Revit 2027 API
TransmissionData.IsTransmitted Property
 Determines whether this file has been transmitted or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTransmitted { get; set; }
Public Property IsTransmitted As Boolean
	Get
	Set
public:
property bool IsTransmitted {
	bool get ();
	void set (bool value);
}
member IsTransmitted : bool with get, set
Property Value
Boolean
Remarks
 "Transmitted" files have been moved from one place to another and are considered to be in a not-final state. Revit will read the TransmissionData on file open and overwrite any data stored in the external file reference elements themselves.
See Also
Reference
TransmissionData Class
Autodesk.Revit.DB Namespace